<template>
    <div >
        <p>三月，醉一场青春的流年。慢步在三月的春光里，走走停停，看花开嫣然，看春雨绵绵，感受春风拂面，春天，就是青春的流年。青春，是人生中最美的风景。青春，是一场花开的遇见；青春，是一场痛并快乐着的旅行；青春，是一场轰轰烈烈的比赛；青春，是一场鲜衣奴马的争荣岁月；青春，是一场风花雪月的光阴。</p>
        <p>青春往事，多么甜蜜；青春岁月，多么靓丽；青春流年，如火如荼。青春里，我们向着梦想前进。跌倒过，伤心过，快乐过，痛苦过，孤独过，彷徨过，迷茫过。总是，在悠悠的岁月中徘徊；总是，在如春的生命中成长；总是，在季节的交替中感悟人生四季的美妙与韵律；总是，在多愁善感中体悟青春的美好与无奈。</p>
        <p v-for="item in items">{{item}}</p>        
    </div>     
</template>
<script>

export default { 
   name:"Info", 
   props:["items"],
    mounted(){
        this.$nextTick(function(){
        this.$parent.test();
        })      
    },
    methods:{
        testzf:function(){
            alert('这是一个子组件的方法哟,在父组件中调用子组件的方法');
        }
    }

}
</script>
 
<style>
</style>